HorseMa/contiki/examples/nrf51822/tasks.c
#include "contiki.h"
#include "tasks.h"
#include "bps.h"
#include "list.h"
#include <string.h>
#include "radio_config.h"
#include "nrf51.h"
#include "spi_master.h"
#include "device.h"
#include "dhcp.h"
#include "config.h"
#include "sockutil.h"
#include "radio_config.h"
#include "w5500.h"
#include "socket.h"
#include "nrf_gpio.h"
#include "util.h"
#include "app_uart.h"
#include <stdio.h>
#include <string.h>
#include "radio.h"
#include "dev_cfg.h"
#include "nrf_drv_wdt.h"
#include "ad_hoc.h"
#include "tags_manage.h"
#include "dev_list.h"

process_event_t ev_433_tx_over;
process_event_t ev_433_rx_over;
process_event_t ev_checkw5500;
process_event_t ev_radio_rcv;
process_event_t ev_2_4g_rcv;
process_event_t ev_data_report_start;
process_event_t ev_data_report_end;

unsigned char phone_num[11];
uint8 pc_ip[4]={10,51,11,177};/*??????IP??*/
static uint8_t socket_buf[2048];
PROCESS(led_process,"led state");
PROCESS(read_gpio_process,"read_gpio");
PROCESS(uartRecv_process,"uartRecv");
PROCESS(si4463_center_process,"si4463");
PROCESS(si4463_enddev_process,"si4463");
PROCESS(ethernet_process,"ethernet");
PROCESS(data_report_process,"data_report");

AUTOSTART_PROCESSES(&uartRecv_process,&led_process,&ethernet_process,&data_report_process,&si4463_center_process,&read_gpio_process);

void clockInit(void)
{
  NRF_CLOCK->EVENTS_HFCLKSTARTED = 0;  					// ??3yía2????ùê±?ó×?±?o?±ê?? 
  NRF_CLOCK->TASKS_HFCLKSTART    = 1;     			// ???ˉía2????ùê±?ó
  while (NRF_CLOCK->EVENTS_HFCLKSTARTED == 0)  	// ía2????ùê±?ó×?±?o?
  {
  }
}
void Hex2Str( const char *sSrc,  char *sDest, int nSrcLen )  
{  
    int  i;  
    char szTmp[3];  
  
    for( i = 0; i < nSrcLen; i++ )  
    {  
        sprintf( szTmp, "%02X", (unsigned char) sSrc[i] );  
        memcpy( &sDest[i * 3], szTmp, 2 );  
        sDest[i * 3 + 2] = ' ';
    }  
    return ;  
}  
unsigned char tags_local[200][9];
int tags_index = 0;
//unsigned char packet[10];
extern nrf_drv_wdt_channel_id m_channel_id;
PROCESS_THREAD(led_process, ev, data)
{ 
  static struct etimer et_blink;
  int i = 0;
  PROCESS_BEGIN();
  ev_2_4g_rcv = process_alloc_event();
  if(stDevCfg.tag_type == 1)
  {
    radio_configure();
  }
  else if(stDevCfg.tag_type == 2)
  {
    radio_configure2();
  }
  else
  {
    
  }

  while(1)
  {
    dev_list_timer_update();
    nrf_drv_wdt_channel_feed(m_channel_id);
    etimer_set(&et_blink, CLOCK_SECOND / 5);
    PROCESS_WAIT_EVENT();  
  }  
  PROCESS_END();
}

static uint8_t global_sn = 0;
PROCESS_THREAD(ethernet_process, ev, data)
{
  static struct etimer et_ethernet;
  uint8_t dhcpret = 0;
  //static uint8_t localip[4] = {10,51,11,172};
  static uint8 ret;
  static uint16_t len = 0;
  static uint16_t loop = 0;
  
  static pst_EthPkgFormat pkg;
  uint8_t checksum;
  
  PROCESS_BEGIN();
  gipo_init();
  //w5500_irq_cfg();
  spi_w5500_init();
  nrf_gpio_pin_clear(W5500_RST);
  etimer_set(&et_ethernet, CLOCK_SECOND / 100);
  PROCESS_WAIT_EVENT();
  nrf_gpio_pin_set(W5500_RST);
  etimer_set(&et_ethernet, CLOCK_SECOND * 2);
  PROCESS_WAIT_EVENT();
  //read_cfg();
  set_default();
  #if 0
  while(1)
  {
    init_dhcp_client();
    for(loop = 0;loop < 10;loop ++)
    {
      etimer_set(&et_ethernet, CLOCK_SECOND / 10);
      PROCESS_WAIT_EVENT();
      dhcpret = check_DHCP_state(SOCK_DHCP);
      if(dhcpret == DHCP_RET_NONE)
      {
      }
      if(dhcpret == DHCP_RET_TIMEOUT)
      {
      }
      if(dhcpret == DHCP_RET_UPDATE)
      {
        break;
      }
      if(dhcpret == DHCP_RET_CONFLICT)
      {
      }
    }
    if(loop >= 5)
    {
      continue;
    }
  }
#endif
  //memcpy(ConfigMsg.lip,localip,4);
  //memcpy(ConfigMsg.lip,localip,4);
  set_network();
  //setRTR(2000);/*设置溢出时间值*/
  //setRCR(3);/*设置最大重新发送次数*/
  //getSIPR (ip);
  //getSUBR(ip);
  //getGAR(ip);
  while(1)
  {
    while(stDefaultCfg.active == 0)
    {
      etimer_set(&et_ethernet, CLOCK_SECOND / 2);
      PROCESS_WAIT_EVENT();
    }
    etimer_set(&et_ethernet, CLOCK_SECOND / 2);
    PROCESS_WAIT_EVENT();
    ret = getSn_SR(SOCK_SERVER);
#if 1
    if(ret == SOCK_INIT)
    {
      //DISABLE_INTERRUPTS();
      // set destination IP
      //set_network();
      IINCHIP_WRITE( Sn_DIPR0(SOCK_SERVER), stDevCfg.server_ip[0]);
      IINCHIP_WRITE( Sn_DIPR1(SOCK_SERVER), stDevCfg.server_ip[1]);
      IINCHIP_WRITE( Sn_DIPR2(SOCK_SERVER), stDevCfg.server_ip[2]);
      IINCHIP_WRITE( Sn_DIPR3(SOCK_SERVER), stDevCfg.server_ip[3]);
      IINCHIP_WRITE( Sn_DPORT0(SOCK_SERVER), (uint8)((stDevCfg.server_port & 0xff00) >> 8));
      IINCHIP_WRITE( Sn_DPORT1(SOCK_SERVER), (uint8)(stDevCfg.server_port & 0x00ff));
      IINCHIP_WRITE( Sn_CR(SOCK_SERVER) ,Sn_CR_CONNECT);
      /* wait for completion */
      while ( IINCHIP_READ(Sn_CR(SOCK_SERVER) ) ) 
      {
        //etimer_set(&et_ethernet, CLOCK_SECOND / 100);
        //PROCESS_WAIT_EVENT();
      }
      etimer_set(&et_ethernet, CLOCK_SECOND / 20);
      PROCESS_WAIT_EVENT();
      loop = 0;
      while ( IINCHIP_READ(Sn_SR(SOCK_SERVER)) != SOCK_SYNSENT )
      {
        if(IINCHIP_READ(Sn_SR(SOCK_SERVER)) == SOCK_ESTABLISHED)
        {
          break;
        }
        if (getSn_IR(SOCK_SERVER) & Sn_IR_TIMEOUT)
        {
          IINCHIP_WRITE(Sn_IR(SOCK_SERVER), (Sn_IR_TIMEOUT));  // clear TIMEOUT Interrupt
          break;
        }
        etimer_set(&et_ethernet, CLOCK_SECOND / 50);
        PROCESS_WAIT_EVENT();
        loop ++;
        if(loop > 50)
        {
          //NVIC_SystemReset();
          /*nrf_gpio_pin_clear(W5500_RST);
          etimer_set(&et_ethernet, CLOCK_SECOND / 100);
          PROCESS_WAIT_EVENT();
          nrf_gpio_pin_set(W5500_RST);
          etimer_set(&et_ethernet, CLOCK_SECOND * 2);
          PROCESS_WAIT_EVENT();*/
          break;
        }
      }
      //ENABLE_INTERRUPTS();
    }
    
#else
    if(ret == SOCK_INIT)
    {
      DISABLE_INTERRUPTS();
      connect(SOCK_SERVER, stDevCfg.server_ip ,stDevCfg.server_port);
      ENABLE_INTERRUPTS();
    }
#endif
    if(ret == SOCK_ESTABLISHED)
    {
      adhocSetWorkMode(WORK_MODE_CENTER);
      //NVIC_DisableIRQ(RADIO_IRQn);
      if(getSn_IR(SOCK_SERVER) & Sn_IR_CON)
      {
        setSn_IR(SOCK_SERVER, Sn_IR_CON);
      }
      //send(SOCK_SERVER,(uint8*)tags_local,200 * 5);
      len=getSn_RX_RSR(SOCK_SERVER);/*len?????????*/
      pkg = (pst_EthPkgFormat)socket_buf;
      if(len>0)
      {
        memset(socket_buf,0,2048);
        recv(SOCK_SERVER,socket_buf,len);/*W5500????Sever???*/
        if(pkg->head != 0xaa55)
        {
          continue;
        }
        if(pkg->dev_id != stDefaultCfg.dev_id)
        {
            continue;
        }
        checksum = 0;
        for(loop = 0;loop < pkg->len - 1 + 2;loop ++)
        {
          checksum += *((uint8_t*)pkg + loop);
        }
        if(*((uint8_t*)pkg + loop) != checksum)
        {
          continue;
        }
        if(pkg->cmd == 0x03)//配置参数
        {
          pkg->sn = global_sn ++;
          pkg->dev_id = stDefaultCfg.dev_id;
          stDevCfg.rx_gain = pkg->data[0];
          stDevCfg.local_ip[0] = pkg->data[1];
          stDevCfg.local_ip[1] = pkg->data[2];
          stDevCfg.local_ip[2] = pkg->data[3];
          stDevCfg.local_ip[3] = pkg->data[4];
          stDevCfg.local_port = pkg->data[5] + (pkg->data[6] * 256);
          stDevCfg.server_ip[0] = pkg->data[7];
          stDevCfg.server_ip[1] = pkg->data[8];
          stDevCfg.server_ip[2] = pkg->data[9];
          stDevCfg.server_ip[3] = pkg->data[10];
          stDevCfg.server_port = pkg->data[11] + (pkg->data[12] * 256);
          stDevCfg.tag_type = pkg->data[13];
          stDevCfg.reserved1 = pkg->data[14] + pkg->data[15] * 256;

