HorseMa/contiki/examples/nrf51822/tasks.c
          write_cfg();
          pkg->data[0] = 'o';
          pkg->data[1] = 'k';
          pkg->len = 7 + 2;
          checksum = 0;
          for(loop = 0;loop < pkg->len - 1 + 2;loop++)
          {
            checksum += *((uint8_t*)pkg + loop);
          }
          *((uint8_t*)pkg + loop) = checksum;
          send(SOCK_SERVER,(uint8_t*)pkg,pkg->len + 2);
          etimer_set(&et_ethernet, CLOCK_SECOND / 1);
          PROCESS_WAIT_EVENT();
          NVIC_SystemReset();
        }
        if(pkg->cmd == 0x04)//读取参数
        {
          pkg->sn = global_sn ++;
          pkg->dev_id = stDefaultCfg.dev_id;
          pkg->data[0] = stDevCfg.rx_gain;
          pkg->data[1] = stDevCfg.local_ip[0];
          pkg->data[2] = stDevCfg.local_ip[1];
          pkg->data[3] = stDevCfg.local_ip[2];
          pkg->data[4] = stDevCfg.local_ip[3];
          pkg->data[5] = (uint8)stDevCfg.local_port;
          pkg->data[6] = (uint8)(stDevCfg.local_port >> 8);
          pkg->data[7] = stDevCfg.server_ip[0];
          pkg->data[8] = stDevCfg.server_ip[1];
          pkg->data[9] = stDevCfg.server_ip[2];
          pkg->data[10] = stDevCfg.server_ip[3];
          pkg->data[11] = (uint8)stDevCfg.server_port;
          pkg->data[12] = (uint8)(stDevCfg.server_port >> 8);
          pkg->data[13] = stDevCfg.tag_type;
          pkg->data[14] = (uint8)stDevCfg.reserved1;
          pkg->data[15] = (uint8)(stDevCfg.reserved1 >> 8);
          pkg->len = 7 + 16;
          checksum = 0;
          for(loop = 0;loop < pkg->len - 1 + 2;loop++)
          {
            checksum += *((uint8_t*)pkg + loop);
          }
          *((uint8_t*)pkg + loop) = checksum;
          send(SOCK_SERVER,(uint8_t*)pkg,pkg->len + 2);

        }
        if(pkg->cmd == 0x0B)//配置参数
        {
          pkg->sn = global_sn ++;
          pkg->dev_id = stDefaultCfg.dev_id;
          stDevCfg.rx_gain = pkg->data[0];
          stDevCfg.local_ip[0] = pkg->data[1];
          stDevCfg.local_ip[1] = pkg->data[2];
          stDevCfg.local_ip[2] = pkg->data[3];
          stDevCfg.local_ip[3] = pkg->data[4];
          stDevCfg.local_port = pkg->data[5] + (pkg->data[6] * 256);
          stDevCfg.gw[0] = pkg->data[7];
          stDevCfg.gw[1] = pkg->data[8];
          stDevCfg.gw[2] = pkg->data[9];
          stDevCfg.gw[3] = pkg->data[10];
          memcpy(stDevCfg.mac,&pkg->data[11],6);
          stDevCfg.sub[0] = pkg->data[7 + 4 + 6];
          stDevCfg.sub[1] = pkg->data[8  + 4 + 6];
          stDevCfg.sub[2] = pkg->data[9  + 4 + 6];
          stDevCfg.sub[3] = pkg->data[10  + 4 + 6];
          
          stDevCfg.server_ip[0] = pkg->data[7 + 4 + 6 + 4];
          stDevCfg.server_ip[1] = pkg->data[8  + 4 + 6 + 4];
          stDevCfg.server_ip[2] = pkg->data[9  + 4 + 6 + 4];
          stDevCfg.server_ip[3] = pkg->data[10  + 4 + 6 + 4];
          stDevCfg.server_port = pkg->data[11  + 4 + 6 + 4] + (pkg->data[12  + 4 + 6 + 4] * 256);
          stDevCfg.tag_type = pkg->data[13  + 4 + 6 + 4];
          stDevCfg.reserved1 = pkg->data[14  + 4 + 6 + 4] + pkg->data[15  + 4 + 6 + 4] * 256;

          write_cfg();
          pkg->data[0] = 'o';
          pkg->data[1] = 'k';
          pkg->len = 7 + 2;
          checksum = 0;
          for(loop = 0;loop < pkg->len - 1 + 2;loop++)
          {
            checksum += *((uint8_t*)pkg + loop);
          }
          *((uint8_t*)pkg + loop) = checksum;
          send(SOCK_SERVER,(uint8_t*)pkg,pkg->len + 2);
          etimer_set(&et_ethernet, CLOCK_SECOND / 1);
          PROCESS_WAIT_EVENT();
          NVIC_SystemReset();
        }
        if(pkg->cmd == 0x0C)//读取参数
        {
          pkg->sn = global_sn ++;
          pkg->dev_id = stDefaultCfg.dev_id;
          pkg->data[0] = stDevCfg.rx_gain;
          pkg->data[1] = stDevCfg.local_ip[0];
          pkg->data[2] = stDevCfg.local_ip[1];
          pkg->data[3] = stDevCfg.local_ip[2];
          pkg->data[4] = stDevCfg.local_ip[3];
          pkg->data[5] = (uint8)stDevCfg.local_port;
          pkg->data[6] = (uint8)(stDevCfg.local_port >> 8);
          pkg->data[7] = stDevCfg.gw[0];
          pkg->data[8] = stDevCfg.gw[1];
          pkg->data[9] = stDevCfg.gw[2];
          pkg->data[10] = stDevCfg.gw[3];
          memcpy(&pkg->data[11],stDevCfg.mac,6);
          pkg->data[7 + 10] = stDevCfg.sub[0];
          pkg->data[8 + 10] = stDevCfg.sub[1];
          pkg->data[9 + 10] = stDevCfg.sub[2];
          pkg->data[10 + 10] = stDevCfg.sub[3];
          
          pkg->data[7 + 10 + 4] = stDevCfg.server_ip[0];
          pkg->data[8 + 10 + 4] = stDevCfg.server_ip[1];
          pkg->data[9 + 10 + 4] = stDevCfg.server_ip[2];
          pkg->data[10 + 10 + 4] = stDevCfg.server_ip[3];
          pkg->data[11 + 10 + 4] = (uint8)stDevCfg.server_port;
          pkg->data[12 + 10 + 4] = (uint8)(stDevCfg.server_port >> 8);
          pkg->data[13 + 10 + 4] = stDevCfg.tag_type;
          pkg->data[14 + 10 + 4] = (uint8)stDevCfg.reserved1;
          pkg->data[15 + 10 + 4] = (uint8)(stDevCfg.reserved1 >> 8);
          pkg->len = 7 + 16 + 10 + 4;
          checksum = 0;
          for(loop = 0;loop < pkg->len - 1 + 2;loop++)
          {
            checksum += *((uint8_t*)pkg + loop);
          }
          *((uint8_t*)pkg + loop) = checksum;
          send(SOCK_SERVER,(uint8_t*)pkg,pkg->len + 2);

        }
        if(pkg->cmd == 0x05)//控制指令
        {
          pkg->sn = global_sn ++;
          pkg->dev_id = stDefaultCfg.dev_id;
          pkg->data[0] = 'o';
          pkg->data[1] = 'k';
          pkg->len = 7 + 2;
          checksum = 0;
          for(loop = 0;loop < pkg->len - 1 + 2;loop++)
          {
            checksum += *((uint8_t*)pkg + loop);
          }
          *((uint8_t*)pkg + loop) = checksum;
          send(SOCK_SERVER,(uint8_t*)pkg,pkg->len + 2);
        }
        if(pkg->cmd == 0x06)//恢复出厂设置
        {
          pkg->sn = global_sn ++;
          pkg->dev_id = stDefaultCfg.dev_id;
          pkg->data[0] = 'o';
          pkg->data[1] = 'k';
          pkg->len = 7 + 2;
          checksum = 0;
          for(loop = 0;loop < pkg->len - 1 + 2;loop++)
          {
            checksum += *((uint8_t*)pkg + loop);
          }
          *((uint8_t*)pkg + loop) = checksum;
          send(SOCK_SERVER,(uint8_t*)pkg,pkg->len + 2);
          earase_cfg();
          stDevCfg.rx_gain = stDefaultCfg.rx_gain;
          memcpy(stDevCfg.local_ip,stDefaultCfg.local_ip,4);
          stDevCfg.local_port = stDefaultCfg.local_port;
          memcpy(stDevCfg.gw,stDefaultCfg.gw,4);
          memcpy(stDevCfg.mac,stDefaultCfg.mac,8);
          memcpy(stDevCfg.server_ip,stDefaultCfg.server_ip,4);
          stDevCfg.server_port = stDefaultCfg.server_port;
          stDevCfg.tag_type = stDefaultCfg.tag_type;
          stDevCfg.reserved1 = 0;
          write_cfg();
          etimer_set(&et_ethernet, CLOCK_SECOND / 1);
          PROCESS_WAIT_EVENT();
          NVIC_SystemReset();
        }
      }
    }
    if(ret == SOCK_CLOSE_WAIT)
    {
      adhocSetWorkMode(WORK_MODE_END_DEVICE);
      //NVIC_EnableIRQ(RADIO_IRQn);
      while(!socket(SOCK_SERVER,Sn_MR_TCP,stDefaultCfg.local_port,Sn_MR_ND))
      {
        etimer_set(&et_ethernet, CLOCK_SECOND / 20);
        PROCESS_WAIT_EVENT();
      }
    }
    if(ret == SOCK_CLOSED)
    {
      adhocSetWorkMode(WORK_MODE_END_DEVICE);
      //NVIC_EnableIRQ(RADIO_IRQn);
      while(!socket(SOCK_SERVER,Sn_MR_TCP,stDefaultCfg.local_port,Sn_MR_ND))
      {
        etimer_set(&et_ethernet, CLOCK_SECOND / 20);
        PROCESS_WAIT_EVENT();
      }
    }
  }
  PROCESS_END();
}

PROCESS_THREAD(data_report_process, ev, data)
{
  static struct etimer et_blink;
  static pst_EthPkgFormat pkg;
  uint16 loop;
  uint8 checksum;
  PROCESS_BEGIN();
  ev_data_report_start = process_alloc_event();
  ev_data_report_end = process_alloc_event();
  pkg = (pst_EthPkgFormat)socket_buf;
  while(1)
  {
    while(adhocGetWorkMode() == WORK_MODE_END_DEVICE)
    {
      etimer_set(&et_blink, CLOCK_SECOND / 5);
      PROCESS_WAIT_EVENT();
    }
    etimer_set(&et_blink, CLOCK_SECOND * 5);
    PROCESS_WAIT_EVENT();
    if(ev == PROCESS_EVENT_TIMER)
    {
      pkg->head = 0xaa55;
      pkg->dev_id = stDefaultCfg.dev_id;
      pkg->sn = global_sn ++;
      pkg->cmd = 0x02;
      pkg->len = 7;
      checksum = 0;
      for(loop = 0;loop < pkg->len - 1 + 2;loop++)
      {
        checksum += *((uint8_t*)pkg + loop);
      }
      *((uint8_t*)pkg + loop) = checksum;
      send(SOCK_SERVER,(uint8_t*)pkg,pkg->len + 2);
    }
    else
    {
      etimer_restart(&et_blink);
    }
  }
  PROCESS_END();
}

PROCESS_THREAD(read_gpio_process, ev, data)
{ 
  static struct etimer et_blink;
  static uint8 cnt = 0;
  PROCESS_BEGIN();
  while(1)
  {
    if(nrf_gpio_pin_read(16) == 0)
    {
        cnt ++;
    }
    else
    {
        cnt = 0;
    }
    if(cnt >= 5000 / 100)
    {
          earase_cfg();
          stDevCfg.rx_gain = stDefaultCfg.rx_gain;
          memcpy(stDevCfg.local_ip,stDefaultCfg.local_ip,4);
          stDevCfg.local_port = stDefaultCfg.local_port;
          memcpy(stDevCfg.gw,stDefaultCfg.gw,4);
          memcpy(stDevCfg.mac,stDefaultCfg.mac,8);
          memcpy(stDevCfg.sub,stDefaultCfg.sub,4);
          memcpy(stDevCfg.server_ip,stDefaultCfg.server_ip,4);
          stDevCfg.server_port = stDefaultCfg.server_port;
          stDevCfg.tag_type = stDefaultCfg.tag_type;
          stDevCfg.reserved1 = 0;
          write_cfg();
          etimer_set(&et_blink, CLOCK_SECOND / 1);
          PROCESS_WAIT_EVENT();
          NVIC_SystemReset();
    }
    etimer_set(&et_blink, CLOCK_SECOND / 10);
    PROCESS_WAIT_EVENT();
  }
  PROCESS_END();
}

void uart_event_handle(app_uart_evt_t * p_event)
{
  
