HorseMa/contiki/examples/nrf51822/tasks.c
}

static uint16 center_addr = 0xffff;
PROCESS_THREAD(uartRecv_process, ev, data)
{ 
  static struct etimer et_blink;
  static uint8 rxbuf[50],txbuf[50];
  app_uart_comm_params_t app_uart_comm_params;
  static app_uart_buffers_t app_uart_buffers;
  PROCESS_BEGIN();
  app_uart_comm_params.rx_pin_no = RX_PIN_NUMBER;
  app_uart_comm_params.tx_pin_no = TX_PIN_NUMBER;
  app_uart_comm_params.flow_control = APP_UART_FLOW_CONTROL_DISABLED;
  app_uart_comm_params.use_parity = false;
  app_uart_comm_params.baud_rate = UART_BAUDRATE_BAUDRATE_Baud38400;
  app_uart_buffers.rx_buf = rxbuf;
  app_uart_buffers.tx_buf = txbuf;
  app_uart_buffers.rx_buf_size = 50;
  app_uart_buffers.tx_buf_size = 50;
  app_uart_init(&app_uart_comm_params,&app_uart_buffers,uart_event_handle,APP_IRQ_PRIORITY_LOW,NULL);
  uart_put_string("NRF TEST!");
  while(1)//匹配波特率
  {
    if(adhocGetWorkMode() == WORK_MODE_CENTER)
    {
      nrf_gpio_pin_toggle(LED3);         // oìμ?áá
      etimer_set(&et_blink, CLOCK_SECOND / 5);
      PROCESS_WAIT_EVENT();             
    }
    else
    {
      if(center_addr == 0xffff)// offline
      {
        nrf_gpio_pin_toggle(LED3);         // oìμ?áá
        etimer_set(&et_blink, CLOCK_SECOND / 5);
        PROCESS_WAIT_EVENT();  
      }
      else// online
      {
        nrf_gpio_pin_toggle(LED3);         // oìμ?áá
        etimer_set(&et_blink, CLOCK_SECOND / 1);
        PROCESS_WAIT_EVENT();  
      }
    }
  }
  
  PROCESS_END();
}

PROCESS_THREAD(si4463_center_process, ev, data)
{
  static struct etimer et_blink;
  pst_PkgFormart pstPkgFormart;
  uint8 checksum = 0;
  uint16 loop = 0;
  static uint8 buf[64];
  static uint16 dev_id;
  PROCESS_BEGIN();
  ev_433_tx_over = process_alloc_event();
  ev_433_rx_over = process_alloc_event();

  //spi_master_init(SPI1, SPI_MODE0, 0);
  //vRadio_Init();
  si4463_irq_cfg();
  dev_list_init();
    while(1)
    {
      while(1)
      {
        if(adhocGetWorkMode() == WORK_MODE_END_DEVICE)
        {
          etimer_set(&et_blink, CLOCK_SECOND / 1);
          PROCESS_WAIT_EVENT();
          continue;
        }
        else
        {
          break;
        }
      }

      etimer_set(&et_blink, CLOCK_SECOND / 2);
      PROCESS_WAIT_EVENT();
      if(!dev_list_get_node(&dev_id))
      {
        pst_EthPkgFormat pkg = (pst_EthPkgFormat)socket_buf;
        DISABLE_INTERRUPTS();
        pkg->len = get_tags_2_4(&pkg->data[1],&pkg->data[0],MAX_LEN);
        ENABLE_INTERRUPTS();
        if(pkg->len > 0)
        {
          pkg->len += (7 + 1);
          pkg->head = 0xaa55;
          pkg->dev_id = stDefaultCfg.dev_id;
          pkg->sn = global_sn ++;
          pkg->cmd = 0x01;
          checksum = 0;
          for(loop = 0;loop < pkg->len - 1 + 2;loop++)
          {
            checksum += *((uint8_t*)pkg + loop);
          }
          *((uint8_t*)pkg + loop) = checksum;
          send(SOCK_SERVER,(uint8_t*)pkg,pkg->len + 2);
          process_post(&data_report_process,ev_data_report_start,NULL);
        }
        //break;
      }
    }
  PROCESS_END();
}
PROCESS_THREAD(si4463_enddev_process, ev, data)
{
  static struct etimer et_blink;
  static uint8 buf[64];
  pst_PkgFormart pstPkgFormart;
  pst_PkgFormart pstPkgFormarttx = (pst_PkgFormart)buf;

  PROCESS_BEGIN();
  vRadio_StartRX(10);
  while(1)
  {
    while(stDefaultCfg.active == 0)
    {
      etimer_set(&et_blink, CLOCK_SECOND / 2);
      PROCESS_WAIT_EVENT();
    }
    while(adhocGetWorkMode() == WORK_MODE_CENTER)
    {
      center_addr = 0xffff;
      etimer_set(&et_blink, CLOCK_SECOND / 5);
      PROCESS_WAIT_EVENT();
    }
    vRadio_StartRX(10);
    PROCESS_WAIT_EVENT();
    if(ev == ev_433_rx_over)
    {
      pstPkgFormart = (pst_PkgFormart)data;
      if(pstPkgFormart->cmd == enBeacon)
      {
        funJoinReqSend(pstPkgFormart->src_addr,buf);//发送入网请求
      }
    }
    else if(ev == ev_433_tx_over)
    {
      
    }
    else
    {
      continue;
    }
    
    while(1)
    {
      etimer_set(&et_blink, CLOCK_SECOND / 5);
      PROCESS_WAIT_EVENT();
      if(ev == PROCESS_EVENT_TIMER)
      {
        break;
      }
      if(ev == ev_433_rx_over)
      {
        pstPkgFormart = (pst_PkgFormart)data;
        if((pstPkgFormart->cmd == enJoinRsp) && (pstPkgFormart->dest_addr == stDefaultCfg.dev_id))
        {
          channel_433m = pstPkgFormart->data[0];
          //write_cfg();
          //vRadio_StartRX(channel_433m);
          center_addr = pstPkgFormart->src_addr;
        }
      }
    }
    vRadio_StartRX(channel_433m);
    etimer_set(&et_blink, CLOCK_SECOND * 30);
    while(center_addr != 0xffff)
    {
      PROCESS_WAIT_EVENT();
      if(ev == PROCESS_EVENT_TIMER)
      {
        center_addr = 0xffff;
        break;
      }
      if(ev == ev_433_rx_over)
      {
        pstPkgFormart = (pst_PkgFormart)data;
        if((pstPkgFormart->cmd == enDataReq) && (pstPkgFormart->dest_addr == stDefaultCfg.dev_id) && (pstPkgFormart->src_addr == center_addr))
        {
          //etimer_set(&et_blink, CLOCK_SECOND * 30);
          etimer_restart(&et_blink);
          pstPkgFormarttx = (pst_PkgFormart)buf;
          pstPkgFormarttx->cmd = enDataRsp;
          pstPkgFormarttx->dest_addr = center_addr;
          pstPkgFormarttx->src_addr = stDefaultCfg.dev_id;
          //DISABLE_INTERRUPTS();
          NVIC_DisableIRQ(RADIO_IRQn);
          get_tags_2_4(&pstPkgFormarttx->data[1],&pstPkgFormarttx->data[0],FIX_LEN);
          //ENABLE_INTERRUPTS();
          if(pstPkgFormarttx->data[0])
          {
            vRadio_StartTx_Variable_Packet(channel_433m,buf,64);
            //PROCESS_WAIT_EVENT();
          }
          else
          {
            NVIC_EnableIRQ(RADIO_IRQn);
          }
          
        }
      }
      if(ev == ev_433_tx_over)
      {
        //etimer_set(&et_blink, CLOCK_SECOND * 30);
        etimer_restart(&et_blink);
        pstPkgFormarttx = (pst_PkgFormart)buf;
        pstPkgFormarttx->cmd = enDataRsp;
        pstPkgFormarttx->dest_addr = center_addr;
        pstPkgFormarttx->src_addr = stDefaultCfg.dev_id;
        //DISABLE_INTERRUPTS();
        get_tags_2_4(&pstPkgFormarttx->data[1],&pstPkgFormarttx->data[0],FIX_LEN);
        //ENABLE_INTERRUPTS();
        if(pstPkgFormarttx->data[0])
        {
          vRadio_StartTx_Variable_Packet(channel_433m,buf,64);
          //PROCESS_WAIT_EVENT();
        }
        else
        {
          NVIC_EnableIRQ(RADIO_IRQn);
        }
      }
    }
    //etimer_stop(&et_blink);
  }
  PROCESS_END();
}
